src/test/resources/ycsb_output.log
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /Users/caiohc/Desenvolvimento/ycsb-0.7.0/workloads/workloadc -p db.driver=org.postgresql.Driver -p db.url=jdbc:postgresql://aquarius.lan:5432/test -p db.user=postgres -p db.passwd=postgres -threads 1 -t
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Using 1 shards
[OVERALL], RunTime(ms), 2871.0
[OVERALL], Throughput(ops/sec), 348.31069313827936
[READ], Operations, 1000.0
[READ], AverageLatency(us), 1300.665
[READ], MinLatency(us), 654.0
[READ], MaxLatency(us), 68799.0
[READ], 95thPercentileLatency(us), 2573.0
[READ], 99thPercentileLatency(us), 5291.0
[READ], Return=OK, 1000
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 1029.0
[CLEANUP], MinLatency(us), 1029.0
[CLEANUP], MaxLatency(us), 1029.0
[CLEANUP], 95thPercentileLatency(us), 1029.0
[CLEANUP], 99thPercentileLatency(us), 1029.0
[UPDATE-FAILED], Operations, 3.0
[UPDATE-FAILED], AverageLatency(us), 2528256.0
[UPDATE-FAILED], MinLatency(us), 2500608.0
[UPDATE-FAILED], MaxLatency(us), 2580479.0
[UPDATE-FAILED], 95thPercentileLatency(us), 2580479.0
[UPDATE-FAILED], 99thPercentileLatency(us), 2580479.0
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /Users/caiohc/Desenvolvimento/ycsb-0.7.0/workloads/workloadc -p db.driver=org.postgresql.Driver -p db.url=jdbc:postgresql://aquarius.lan:5432/test -p db.user=postgres -p db.passwd=postgres -threads 2 -t
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Using 1 shards
Using 1 shards
[OVERALL], RunTime(ms), 1122.0
[OVERALL], Throughput(ops/sec), 891.2655971479501
[READ], Operations, 1000.0
[READ], AverageLatency(us), 1434.555
[READ], MinLatency(us), 614.0
[READ], MaxLatency(us), 93695.0
[READ], 95thPercentileLatency(us), 2663.0
[READ], 99thPercentileLatency(us), 5595.0
[READ], Return=OK, 1000
[CLEANUP], Operations, 2.0
[CLEANUP], AverageLatency(us), 491.5
[CLEANUP], MinLatency(us), 215.0
[CLEANUP], MaxLatency(us), 768.0
[CLEANUP], 95thPercentileLatency(us), 768.0
[CLEANUP], 99thPercentileLatency(us), 768.0
[UPDATE-FAILED], Operations, 3.0
[UPDATE-FAILED], AverageLatency(us), 2528256.0
[UPDATE-FAILED], MinLatency(us), 2500608.0
[UPDATE-FAILED], MaxLatency(us), 2580479.0
[UPDATE-FAILED], 95thPercentileLatency(us), 2580479.0
[UPDATE-FAILED], 99thPercentileLatency(us), 2580479.0
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /Users/caiohc/Desenvolvimento/ycsb-0.7.0/workloads/workloadc -p db.driver=org.postgresql.Driver -p db.url=jdbc:postgresql://aquarius.lan:5432/test -p db.user=postgres -p db.passwd=postgres -threads 3 -t
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Using 1 shards
Using 1 shards
Using 1 shards
[OVERALL], RunTime(ms), 920.0
[OVERALL], Throughput(ops/sec), 1086.9565217391305
[READ], Operations, 1000.0
[READ], AverageLatency(us), 1554.953
[READ], MinLatency(us), 595.0
[READ], MaxLatency(us), 118719.0
[READ], 95thPercentileLatency(us), 2725.0
[READ], 99thPercentileLatency(us), 9727.0
[READ], Return=OK, 1000
[CLEANUP], Operations, 3.0
[CLEANUP], AverageLatency(us), 378.6666666666667
[CLEANUP], MinLatency(us), 90.0
[CLEANUP], MaxLatency(us), 939.0
[CLEANUP], 95thPercentileLatency(us), 939.0
[CLEANUP], 99thPercentileLatency(us), 939.0
[UPDATE-FAILED], Operations, 3.0
[UPDATE-FAILED], AverageLatency(us), 2528256.0
[UPDATE-FAILED], MinLatency(us), 2500608.0
[UPDATE-FAILED], MaxLatency(us), 2580479.0
[UPDATE-FAILED], 95thPercentileLatency(us), 2580479.0
[UPDATE-FAILED], 99thPercentileLatency(us), 2580479.0
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /Users/caiohc/Desenvolvimento/ycsb-0.7.0/workloads/workloadc -p db.driver=org.postgresql.Driver -p db.url=jdbc:postgresql://aquarius.lan:5432/test -p db.user=postgres -p db.passwd=postgres -threads 4 -t
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
[...]
Using 1 shards
Using 1 shards
Using 1 shards
[...]
[OVERALL], RunTime(ms), 929.0
[OVERALL], Throughput(ops/sec), 1076.4262648008612
[READ], Operations, 1000.0
[READ], AverageLatency(us), 2131.643
[READ], MinLatency(us), 593.0
[READ], MaxLatency(us), 100479.0
[READ], 95thPercentileLatency(us), 7291.0
[READ], 99thPercentileLatency(us), 14647.0
[READ], Return=OK, 1000
[CLEANUP], Operations, 4.0
[CLEANUP], AverageLatency(us), 770.75
[CLEANUP], MinLatency(us), 238.0
[CLEANUP], MaxLatency(us), 1583.0
[CLEANUP], 95thPercentileLatency(us), 1583.0
[CLEANUP], 99thPercentileLatency(us), 1583.0
[UPDATE-FAILED], Operations, 3.0
[UPDATE-FAILED], AverageLatency(us), 2528256.0
[UPDATE-FAILED], MinLatency(us), 2500608.0
[UPDATE-FAILED], MaxLatency(us), 2580479.0
[UPDATE-FAILED], 95thPercentileLatency(us), 2580479.0
[UPDATE-FAILED], 99thPercentileLatency(us), 2580479.0
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /Users/caiohc/Desenvolvimento/ycsb-0.7.0/workloads/workloadc -p db.driver=org.postgresql.Driver -p db.url=jdbc:postgresql://aquarius.lan:5432/test -p db.user=postgres -p db.passwd=postgres -threads 5 -t
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
Adding shard node URL: jdbc:postgresql://aquarius.lan:5432/test
[...]
Using 1 shards
Using 1 shards
Using 1 shards
[...]
[OVERALL], RunTime(ms), 919.0
[OVERALL], Throughput(ops/sec), 1088.139281828074
[READ], Operations, 1000.0
[READ], AverageLatency(us), 2462.835
[READ], MinLatency(us), 608.0
[READ], MaxLatency(us), 139135.0
[READ], 95thPercentileLatency(us), 3975.0
[READ], 99thPercentileLatency(us), 33311.0
[READ], Return=OK, 1000
[CLEANUP], Operations, 5.0
[CLEANUP], AverageLatency(us), 1643.2
[CLEANUP], MinLatency(us), 105.0
[CLEANUP], MaxLatency(us), 6719.0
[CLEANUP], 95thPercentileLatency(us), 6719.0
[CLEANUP], 99thPercentileLatency(us), 6719.0
[UPDATE-FAILED], Operations, 3.0
[UPDATE-FAILED], AverageLatency(us), 2528256.0
[UPDATE-FAILED], MinLatency(us), 2500608.0
[UPDATE-FAILED], MaxLatency(us), 2580479.0
[UPDATE-FAILED], 95thPercentileLatency(us), 2580479.0
[UPDATE-FAILED], 99thPercentileLatency(us), 2580479.0